# coding=gbk

# format()的实际使用例子

N = 'Gavin'
print(format(N, '10'))        # 没有标志符，如果是字符串则默认左对齐，不足宽度部分默认用空格填充
print(format(81.23, '10'))    # 没有标志符，如果是数字则默认右对齐，不足宽度部分默认用空格填充
print(format(N, '0>10'))      # 右对齐，不足指定宽度部分用0填充
print(format(N, '0>4'))       # 右对齐，因字符实际宽度大于指定宽度4，不用填充
print(format(N, '*>10'))      # 右对齐，不足部分用“*”填充
print(format(N, '>010'))      # 右对齐，不足部分用0填充
print(format(N, '>10'))       # 右对齐，默认用空格填充
print(format(N, '<10'))       # 左对齐，默认用空格填充
print(format(N, '<010'))      # 左对齐，不足部分用0填充
print(format(N, '@^10'))      # 中间对齐，不足部分用“@”填充，宽度为10个空格
print(format(81.23, '0<10'))  # 左对齐，不足部分用0填充
print(format(81.23, '@^10'))  # 右对齐，不足部分用“@”填充
print(format(81.23, '0>10'))  # 右对齐，不足部分用0填充
print(format(-81.23, '0=10')) # 右对齐，负号后面不足部分用0填充
